monte-monte/ch32v003fun/minichlink/pgm-b003fun.c
#include <stdint.h>
#include "hidapi.h"
#include "minichlink.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "chips.h"
#include "../ch32fun/ch32fun.h"

//#define DEBUG_B003

#if defined(WINDOWS) || defined(WIN32) || defined(_WIN32)
void Sleep(uint32_t dwMilliseconds);
#define usleep( x ) Sleep( x / 1000 )
#define sleep( x ) Sleep( x * 1000 )
#else
#include <unistd.h>
#endif

#define MAX_USB_ERR 10000
#define TERMINAL_FEATURE_ID 0xFD

struct B003FunProgrammerStruct
{
	void * internal; // Part of struct ProgrammerStructBase 
	hid_device * hd;
	uint8_t commandbuffer[128];
	uint8_t respbuffer[128];
	int commandplace;
	int prepping_for_erase;
	int no_get_report;
	int err_count;
};

static const unsigned char byte_wise_read_blob[] = { // No alignment restrictions.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x94, 0x21, 0x14, 0xa3, 0x85, 0x05, 0x05, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char half_wise_read_blob[] = {  // size and address must be aligned by 2.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x96, 0x21, 0x16, 0xa3, 0x89, 0x05, 0x09, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char word_wise_read_blob[] = { // size and address must be aligned by 4.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x94, 0x41, 0x14, 0xc3, 0x91, 0x05, 0x11, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80,
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char word_wise_write_blob[] = { // size and address must be aligned by 4.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x43, 0x94, 0xc1, 0x91, 0x05, 0x11, 0x07,
	0xe3, 0xcc, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff, 0x14, 0xc1, 0x82, 0x80, // NOTE: No readback!
	0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
/*
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x43, 0x94, 0xc1, 0x94, 0x41, 0x14, 0xc3, // With readback.
	0x91, 0x05, 0x11, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 */
};

static const unsigned char write64_flash[] = { // size and address must be aligned by 4.
	0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x13, 0x86, 0x05, 0x04, 0x5c, 0x43,
	0x8c, 0xc7, 0x14, 0x47, 0x94, 0xc1, 0xb7, 0x06, 0x05, 0x00, 0xd4, 0xc3,
	0x94, 0x41, 0x91, 0x05, 0x11, 0x07, 0xe3, 0xc8, 0xc5, 0xfe, 0xc1, 0x66,
	0x93, 0x86, 0x06, 0x04, 0xd4, 0xc3, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80
};

static const unsigned char half_wise_write_blob[] = { // size and address must be aligned by 2
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x16, 0x23, 0x96, 0xa1, 0x96, 0x21, 0x16, 0xa3,
	0x89, 0x05, 0x09, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const unsigned char byte_wise_write_blob[] = { // no division requirements.
	0x23, 0xa0, 0x05, 0x00, 0x13, 0x07, 0x45, 0x03, 0x0c, 0x43, 0x50, 0x43,
	0x2e, 0x96, 0x21, 0x07, 0x14, 0x23, 0x94, 0xa1, 0x94, 0x21, 0x14, 0xa3,
	0x85, 0x05, 0x05, 0x07, 0xe3, 0xca, 0xc5, 0xfe, 0x93, 0x06, 0xf0, 0xff,
	0x14, 0xc1, 0x82, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

// Just set the countdown to 0 to avoid any issues.
//   li a3, 0; sw a3, 0(a1); li a3, -1; sw a3, 0(a0); ret;
static const unsigned char halt_wait_blob[] = {
	0x81, 0x46, 0x94, 0xc1, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80 };

// Set the countdown to -1 to cause main system to execute.
//   li a3, -1; sw a3, 0(a1); li a3, -1; sw a3, 0(a0); ret;
//static const unsigned char run_app_blob[] = {
//	0xfd, 0x56, 0x94, 0xc1, 0xfd, 0x56, 0x14, 0xc1, 0x82, 0x80 };
//
// Alternatively, we do it ourselves.

// Run app blob (old):
// static const unsigned char run_app_blob[] = {
// 	0x37, 0x07, 0x67, 0x45, 0xb7, 0x27, 0x02, 0x40, 0x13, 0x07, 0x37, 0x12,
// 	0x98, 0xd7, 0x37, 0x97, 0xef, 0xcd, 0x13, 0x07, 0xb7, 0x9a, 0x98, 0xd7,
// 	0x23, 0xa6, 0x07, 0x00, 0x13, 0x07, 0x00, 0x08, 0x98, 0xcb, 0xb7, 0xf7,
// 	0x00, 0xe0, 0x37, 0x07, 0x00, 0x80, 0x23, 0xa8, 0xe7, 0xd0, 0x82, 0x80,
// };

// Run app blob (new):
static const unsigned char run_app_blob[] = {
	0xb7,0xf5,0xff,0x1f,  // li     a1,0x1FFFF000   - load offset to a1
	0x93,0x87,0xc5,0x77,  // addi   a5,a1,0x77C     - load absolute address of secret area to a5
	0x03,0xa7,0x07,0x00,  // lw     a4,0(a5)        - load reboot function offset + xor from secret to a4
	0x13,0x57,0x07,0x01,  // srli   a4,a4,16        - shift it to remove lower part (offset)
	0x83,0x96,0x07,0x00,  // lh     a3,0(a5)        - load offset part to a3
	0x93,0xc7,0xc6,0x77,  // xori   a5,a3,0x77C     - find current xor
	0x63,0x16,0xf7,0x00,  // bne    a4,a5,.L2       - if xor is valid
	0x33,0x87,0xb6,0x00,  // add    a4, a3, a1      - make absolute address of reboot function an jump
	0x67,0x00,0x07,0x00,  // jr     a4              - jump to it
	/* else - means that we didn't find a reboot function address
	and need to send the blob to do a reboot
.L2:                                                - Same sequence as in "Run app blob (old)"*/
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x87,0x02,  // addi   a5,a5,40
	0x37,0x07,0x67,0x45,  // li     a4,1164378112
	0x13,0x07,0x37,0x12,  // addi   a4,a4,291
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x87,0x02,  // addi   a5,a5,40
	0x37,0x97,0xef,0xcd,  // li     a4,-839938048
	0x13,0x07,0xb7,0x9a,  // addi   a4,a4,-1621
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0xc7,0x00,  // addi   a5,a5,12
	0x23,0xa0,0x07,0x00,  // sw     zero,0(a5)
	0xb7,0x27,0x02,0x40,  // li     a5,1073881088
	0x93,0x87,0x07,0x01,  // addi   a5,a5,16
	0x13,0x07,0x00,0x08,  // li     a4,128
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
	0xb7,0xf7,0x00,0xe0,  // li     a5,-536809472
	0x93,0x87,0x07,0xd1,  // addi   a5,a5,-752
	0x37,0x07,0x00,0x80,  // li     a4,-2147483648
	0x23,0xa0,0xe7,0x00,  // sw     a4,0(a5)
};

static void ResetOp( struct B003FunProgrammerStruct * eps )
{
	memset( eps->commandbuffer, 0, sizeof( eps->commandbuffer ) );
	memcpy( eps->commandbuffer, "\xaa\x00\x00\x00", 4 );
	eps->commandplace = 4;
}

static void WriteOp4( struct B003FunProgrammerStruct * eps, uint32_t opsend )
{
	int place = eps->commandplace;
	int newend = place + 4;
	if( newend < sizeof( eps->commandbuffer ) )
	{
		memcpy( eps->commandbuffer + place, &opsend, 4 );
	}
	eps->commandplace = newend;
}

static void WriteOpArb( struct B003FunProgrammerStruct * eps, const uint8_t * data, int len )
{
	int place = eps->commandplace;
	int newend = place + len;
	if( newend < sizeof( eps->commandbuffer ) )
	{
		memcpy( eps->commandbuffer + place, data, len );
	}
	eps->commandplace = newend;
}

static int CommitOp( struct B003FunProgrammerStruct * eps )
{
	int retries = 0;
	int r;

	uint32_t magic_go = 0x1234abcd;
	memcpy( eps->commandbuffer + 124, &magic_go, 4 );

