monte-monte/ch32v003fun/minichlink/pgm-b003fun.c
	#ifdef DEBUG_B003
	{
		int i;
		printf( "Commit TX: %lu bytes\n", sizeof(eps->commandbuffer)  );
		for( i = 0; i < sizeof(eps->commandbuffer) ; i++ )
		{
			printf( "%02x ", eps->commandbuffer[i] );
			if( ( i & 0xf ) == 0xf ) printf( "\n" );
		}
		if( ( i & 0xf ) != 0xf ) printf( "\n" );
	}
	#endif

resend:
	r = hid_send_feature_report( eps->hd, eps->commandbuffer, sizeof(eps->commandbuffer) );
	#ifdef DEBUG_B003
	printf( "hid_send_feature_report = %d\n", r );
	#endif
	if( r < 0 )
	{
		if( retries ) fprintf( stderr, "Warning: Issue with hid_send_feature_report. Retrying: %d\n", retries );
		if( retries++ > 10 )
		{
			return r;
		}
		else
		{
			MCF.DelayUS( eps, 5000 );
			goto resend;
		}
	}

	if (eps->no_get_report) return r;

	int timeout = 0;

	do
	{
		eps->respbuffer[0] = 0xaa;
		r = hid_get_feature_report( eps->hd, eps->respbuffer, sizeof(eps->respbuffer) );

		#ifdef DEBUG_B003
		{
			int i;
			printf( "Commit RX: %d bytes\n", r );
			for( i = 0; i < r; i++ )
			{
				printf( "%02x ", eps->respbuffer[i] );
				if( ( i & 0xf ) == 0xf ) printf( "\n" );
			}
			if( ( i & 0xf ) != 0xf ) printf( "\n" );
		}
		#endif

		if( r < 0 )
		{
			if( retries++ > 10 ) return r;
			continue;
		}

		if( eps->respbuffer[1] == 0xff ) break;

		if( timeout++ > 20 )
		{
			printf( "Error: Timed out waiting for stub to complete\n" );
			return -99;
		}
	} while( 1 );
	return 0;
}

static int B003FunFlushLLCommands( void * dev )
{
	// All commands are synchronous anyway.
	return 0;
}


static int B003FunWaitForDoneOp( void * dev, int ignore )
{
	// It's synchronous, so no issue here.
	return 0;
}

// static int B003FunDelayUS( void * dev, int microseconds )
// {
	// usleep( microseconds );
// 	return 0;
// }

// Does not handle erasing
static int InternalB003FunWriteBinaryBlob( void * dev, uint32_t address_to_write_to, uint32_t write_size, const uint8_t * blob )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;

	int is_flash = IsAddressFlash( address_to_write_to );

	if( ( address_to_write_to & 0x1 ) && write_size > 0 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_write_blob, sizeof(byte_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 1 ); // write 1 bytes.
		memcpy( &eps->commandbuffer[60], blob, 1 );
		if( CommitOp( eps ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 1 ) ) goto verifyfail;
		blob++;
		write_size --;
		address_to_write_to++;
	}
	if( ( address_to_write_to & 0x2 ) && write_size > 1 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_write_blob, sizeof(half_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 2 ); // write 2 bytes.
		memcpy( &eps->commandbuffer[60], blob, 2 );
		if( CommitOp( eps ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 2 ) ) goto verifyfail;
		blob += 2;
		write_size -= 2;
		address_to_write_to+=2;
	}
	while( write_size > 3 )
	{
		int to_write_this_time = write_size & (~3);
		if( to_write_this_time > 64 ) to_write_this_time = 64;

		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, word_wise_write_blob, sizeof(word_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, to_write_this_time ); // write 4 bytes.
		memcpy( &eps->commandbuffer[60], blob, to_write_this_time );
		if( CommitOp( eps ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, to_write_this_time ) ) goto verifyfail;
		blob += to_write_this_time;
		write_size -= to_write_this_time;
		address_to_write_to += to_write_this_time;
	}
	if( write_size > 1 )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_write_blob, sizeof(half_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 2 ); // write 2 bytes.
		memcpy( &eps->commandbuffer[60], blob, 2 );
		if( CommitOp( eps ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 2 ) ) goto verifyfail;
		blob += 2;
		write_size -= 2;
		address_to_write_to += 2;
	}
	if( write_size )
	{
		// Need to do byte-wise writing in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_write_blob, sizeof(byte_wise_write_blob) );
		WriteOp4( eps, address_to_write_to ); // Base address to write.
		WriteOp4( eps, 1 ); // write 1 byte.
		memcpy( &eps->commandbuffer[60], blob, 1 );
		if( CommitOp( eps ) ) return -5;
		if( is_flash && memcmp( &eps->respbuffer[60], blob, 1 ) ) goto verifyfail;
		blob += 1;
		write_size -= 1;
		address_to_write_to+=1;
	}
	eps->prepping_for_erase = 0;
	fprintf(stderr, ".");
	return 0;
verifyfail:
	fprintf( stderr, "Error: Write Binary Blob: %d bytes to %08x\n", write_size, address_to_write_to );
	return -6;
}

static int B003FunReadBinaryBlob( void * dev, uint32_t address_to_read_from, uint32_t read_size, uint8_t * blob )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;

#ifdef DEBUG_B003
	printf( "Read Binary Blob: %d bytes from %08x\n", read_size, address_to_read_from );
#endif

	if( ( address_to_read_from & 0x1 ) && read_size > 0 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 bytes.
		if( CommitOp( eps ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob++;
		read_size --;
		address_to_read_from++;
	}
	if( ( address_to_read_from & 0x2 ) && read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from+=2;
	}
	while( read_size > 3 )
	{
		int to_read_this_time = read_size & (~3);
		if( to_read_this_time > 64 ) to_read_this_time = 64;

		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, word_wise_read_blob, sizeof(word_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, to_read_this_time ); // Read 4 bytes.
		if( CommitOp( eps ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], to_read_this_time );
		blob += to_read_this_time;
		read_size -= to_read_this_time;
		address_to_read_from += to_read_this_time;
	}
	if( read_size > 1 )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, half_wise_read_blob, sizeof(half_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 2 ); // Read 2 bytes.
		if( CommitOp( eps ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 2 );
		blob += 2;
		read_size -= 2;
		address_to_read_from += 2;
	}
	if( read_size )
	{
		// Need to do byte-wise reading in front to line up with word alignment.
		ResetOp( eps );
		WriteOpArb( eps, byte_wise_read_blob, sizeof(byte_wise_read_blob) );
		WriteOp4( eps, address_to_read_from ); // Base address to read.
		WriteOp4( eps, 1 ); // Read 1 byte.
		if( CommitOp( eps ) ) return -5;
		memcpy( blob, &eps->respbuffer[60], 1 );
		blob += 1;
		read_size -= 1;
		address_to_read_from+=1;
	}
	return 0;
}

static int InternalB003FunBoot( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;

	printf( "Booting\n" );
	ResetOp( eps );
	WriteOpArb( eps, run_app_blob, sizeof(run_app_blob) );
	// for( int i = 0; i < 128; i++ )
	// {
	// 	printf( "%02x ", eps->commandbuffer[i] );
	// }
	// printf( "\n" );
	eps->no_get_report = 1;
	if( CommitOp( eps ) ) return -5;
	return 0;
}

static int B003FunSetupInterface( void * dev )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = (struct InternalState*)(((struct B003FunProgrammerStruct*)eps)->internal);
	iss->target_chip = &ch32v003;
	iss->target_chip_type = CHIP_CH32V003;
	iss->flash_size = 16;
	iss->ram_base = iss->target_chip->ram_base;
	iss->ram_size = iss->target_chip->ram_size;
	iss->sector_size = iss->target_chip->sector_size;
	printf( "Halting Boot Countdown\n" );
	ResetOp( eps );
	WriteOpArb( eps, halt_wait_blob, sizeof(halt_wait_blob) );
	if( CommitOp( eps ) ) return -5;
	
	uint32_t one;
	int two;
	uint8_t read_protection = 0;
	MCF.ReadWord( dev, 0x4002201c, &one );
	MCF.ReadWord( dev, 0x40022020, (uint32_t*)&two );
	
	if( (one & 2) || two != -1 ) read_protection = 1;

	uint8_t uuid[8];
	fprintf( stderr, "Detected %s\n", iss->target_chip->name_str );
	fprintf( stderr, "Flash Storage: %d kB\n", iss->flash_size );
	if( MCF.GetUUID( dev, uuid ) ) fprintf( stderr, "Couldn't read UUID\n" );
	else fprintf( stderr, "Part UUID: %02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x\n", uuid[0], uuid[1], uuid[2], uuid[3], uuid[4], uuid[5], uuid[6], uuid[7] );
	// fprintf( stderr, "Part Type: %02x-%02x-%02x-%02x\n", part_type[3], part_type[2], part_type[1], part_type[0] );
	fprintf( stderr, "Read protection: %s\n", (read_protection > 0)?"enabled":"disabled" );
	return 0;
}

static int B003FunExit( void * dev )
{	
	return 0;
}

// MUST be 4-byte-aligned.
static int B003FunWriteWord( void * dev, uint32_t address_to_write, uint32_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 4, (uint8_t*)&data );
}

static int B003FunReadWord( void * dev, uint32_t address_to_read, uint32_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 4, (uint8_t*)data );
}

static int B003FunBlockWrite64( void * dev, uint32_t address_to_write, const uint8_t * data )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct*) dev;
	struct InternalState * iss = eps->internal;

