monte-monte/ch32v003fun/minichlink/pgm-b003fun.c
	if( IsAddressFlash( address_to_write ) )
	{
		if( !iss->flash_unlocked )
		{
			int rw;
			if( ( rw = InternalUnlockFlash( dev, iss ) ) )
				return rw;
		}

		if( !InternalIsMemoryErased( iss, address_to_write ) )
		{
			if( MCF.Erase( dev, address_to_write, 64, 0 ) )
			{
				fprintf( stderr, "Error: Failed to erase sector at %08x\n", address_to_write );
				return -9;
			}
		}

		// Not actually needed.
		MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG ); // (intptr_t)&FLASH->CTLR = 0x40022010
		MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG | CR_BUF_RST); // (intptr_t)&FLASH->CTLR = 0x40022010

		ResetOp( eps );
		WriteOpArb( eps, write64_flash, sizeof(write64_flash) );
		WriteOp4( eps, address_to_write ); // Base address to write. @52
		WriteOp4( eps, 0x4002200c ); // FLASH STATR base address. @ 56
		memcpy( &eps->commandbuffer[60], data, 64 ); // @60
		if( MCF.PrepForLongOp ) MCF.PrepForLongOp( dev );  // Give the programmer a headsup this next operation could take a while.
		if( CommitOp( eps ) ) return -5;

		// This is actually built-in.
//		MCF.WriteWord( dev, 0x40022010, CR_PAGE_PG|CR_STRT_Set); // (intptr_t)&FLASH->CTLR = 0x40022010  (actually commit)
	}
	else
	{
		return InternalB003FunWriteBinaryBlob( dev, address_to_write, 64, data );
	}

	return 0;
}

static int B003FunWriteHalfWord( void * dev, uint32_t address_to_write, uint16_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 2, (uint8_t*)&data );
}

static int B003FunReadHalfWord( void * dev, uint32_t address_to_read, uint16_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 2, (uint8_t*)data );
}

static int B003FunWriteByte( void * dev, uint32_t address_to_write, uint8_t data )
{
	return InternalB003FunWriteBinaryBlob( dev, address_to_write, 1, &data );
}

static int B003FunReadByte( void * dev, uint32_t address_to_read, uint8_t * data )
{
	return B003FunReadBinaryBlob( dev, address_to_read, 1, data );
}


static int B003FunHaltMode( void * dev, int mode )
{
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)dev)->internal);
	switch ( mode )
	{
	case HALT_MODE_HALT_BUT_NO_RESET: // Don't reboot.
	case HALT_MODE_HALT_AND_RESET:    // Reboot and halt
		// This programmer is always halted anyway.
		break;

	case HALT_MODE_REBOOT:            // Actually boot?
		InternalB003FunBoot( dev );
		break;

	case HALT_MODE_RESUME:
		fprintf( stderr, "Warning: this programmer cannot resume\n" );
		// We can't do this.
		break;

	case HALT_MODE_GO_TO_BOOTLOADER:
		fprintf( stderr, "Warning: this programmer is already a bootloader.  Can't go into bootloader\n" );
		break;

	default:
		fprintf( stderr, "Error: Unknown halt mode %d\n", mode );
	}

	iss->processor_in_mode = mode;
	return 0;
}


int B003FunPrepForLongOp( void * dev )
{
	struct B003FunProgrammerStruct * d = (struct B003FunProgrammerStruct*)dev;
	d->prepping_for_erase = 1;
	return 0;
}

int B003PollTerminal( void * dev, uint8_t * buffer, int maxlen, uint32_t leaveflagA, int leaveflagB )
{
	struct B003FunProgrammerStruct * eps = (struct B003FunProgrammerStruct *)dev;
	struct InternalState * iss = (struct InternalState*)(((struct ProgrammerStructBase*)eps)->internal);
	int r;
	uint8_t rr;
	if( iss->statetag != STTAG( "TERM" ) )
	{
		iss->statetag = STTAG( "TERM" );
	}

	if( maxlen < 8 ) return -9;

	eps->respbuffer[0] = TERMINAL_FEATURE_ID;
	r = hid_get_feature_report( eps->hd, eps->respbuffer, 8 );

	if( (leaveflagA>>8) ) {
		memset( eps->commandbuffer, 0, 8 );
		*((uint32_t*)eps->commandbuffer) = leaveflagA;
		*((uint32_t*)eps->commandbuffer+1) = leaveflagB;
		eps->commandbuffer[0] = TERMINAL_FEATURE_ID;
		eps->commandbuffer[1] = (leaveflagA>>8) & 0xFF;
		r = hid_send_feature_report( eps->hd, eps->commandbuffer, 8 );
	}

#if MAX_USB_ERR
	if( r < 0 ) eps->err_count++;
	else eps->err_count = 0;

	if( eps->err_count > MAX_USB_ERR ) return -8;
#endif

	rr = eps->respbuffer[0];
	if( rr == TERMINAL_FEATURE_ID ) return -1;	// USB just ack'ed
	if( rr & 0x80 )
	{
		int num_printf_chars = (rr & 0xf)-4;
		memcpy( buffer, eps->respbuffer+1, num_printf_chars );
		*(buffer+num_printf_chars) = 0; //  For ease of mind make the buffer a C-string
		if( num_printf_chars <= 0 ) return num_printf_chars-1;
		return num_printf_chars;
	}
	else
	{
		return -1;
	}
}

static int B003FunGetUUID(void * dev, uint8_t * buffer)
{
	int ret = 0;
	uint8_t local_buffer[8] = {0, 0, 0, 0, 0, 0, 0, 0};

	ret |= MCF.ReadWord( dev, 0x1ffff7e8, (uint32_t*)local_buffer );			
	ret |= MCF.ReadWord( dev, 0x1ffff7ec, (uint32_t*)(local_buffer + 4) );
	
	*((uint32_t*)buffer) = local_buffer[0]<<24|local_buffer[1]<<16|local_buffer[2]<<8|local_buffer[3];
	*(((uint32_t*)buffer)+1) = local_buffer[4]<<24|local_buffer[5]<<16|local_buffer[6]<<8|local_buffer[7];
	return ret;
}

void * TryInit_B003Fun(uint32_t id)
{
	hid_init();
	fprintf( stderr, "VID:0x%04x, PID:0x%04x\n", id>>16, id&0xFFFF );
	hid_device * hd = hid_open( id>>16, id&0xFFFF, 0); // third parameter is "serial"
	if( !hd ) {
		hd = hid_open(0x1209, 0xd003, 0);	//	Looking for default rv003usb device
		if (!hd) {
			return 0;
		} else {
			fprintf( stderr, "Trying to reboot into bootloader\n");
			uint8_t buffer[7] = { 0xfd, 0x12, 0x34, 0xaa, 0xbb, 0xcc, 0xdd };
			hid_send_feature_report(hd, buffer, sizeof(buffer));	// Sending magic soft reboot command
			fprintf( stderr, "Sent magic packet\n");
			memset(buffer, 0, 7);
			int r2 = hid_get_feature_report(hd, buffer, 7);
			// I wish we had a better way to know if target understands our magic command
			if (r2 < 0) {
				for (int i = 0; i < 5; i++) {
					hd = hid_open( id>>16, id&0xFFFF, 0);
					if (hd) break;
					sleep(1);
				}
			}
			// hd = hid_open( id>>16, id&0xFFFF, 0);
			if (!hd) return 0;
		}
	}

	//extern int g_hidapiSuppress;
	//g_hidapiSuppress = 1;  // Suppress errors for this device.  (don't do this yet)

	struct B003FunProgrammerStruct * eps = malloc( sizeof( struct B003FunProgrammerStruct ) );
	memset( eps, 0, sizeof( *eps ) );
	eps->hd = hd;
	eps->commandplace = 1;
	memset( &MCF, 0, sizeof( MCF ) );
	MCF.WriteReg32 = 0;
	MCF.ReadReg32 = 0;
	MCF.FlushLLCommands = B003FunFlushLLCommands;
	// MCF.DelayUS = B003FunDelayUS;
	MCF.Control3v3 = 0;
	MCF.SetupInterface = B003FunSetupInterface;
	MCF.Exit = B003FunExit;
	MCF.HaltMode = 0;
	MCF.VoidHighLevelState = 0;
	MCF.PollTerminal = B003PollTerminal;

	// These are optional. Disabling these is a good mechanism to make sure the core functions still work.
	
	MCF.WriteWord = B003FunWriteWord;
	MCF.ReadWord = B003FunReadWord;

