monte-monte/ch32v003fun/minichlink/pgm-b003fun.c
	MCF.WriteHalfWord = B003FunWriteHalfWord;
	MCF.ReadHalfWord = B003FunReadHalfWord;

	MCF.WriteByte = B003FunWriteByte;
	MCF.ReadByte = B003FunReadByte;

	MCF.WaitForDoneOp = B003FunWaitForDoneOp;
	MCF.BlockWrite64 = B003FunBlockWrite64;
	MCF.ReadBinaryBlob = B003FunReadBinaryBlob;

	MCF.PrepForLongOp = B003FunPrepForLongOp;

	MCF.HaltMode = B003FunHaltMode;

	MCF.GetUUID = B003FunGetUUID;

	return eps;
}





// Utility for generating bootloader code:

// make rv003usb.bin &&  xxd -i -s 100 -l 44 rv003usb.bin

/*
// Read data, arbitrarily from memory. (byte-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LBU(a3, a1, 0);	//lbu a3, 0(a1)       // Read from RAM
	XW_C_SB(a3, a4, 0);		//sb a3, 0(a4)       // Store into scratchpad
	c.addi a1, 1        // Advance pointers
	c.addi a4, 1
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0,0
*/

/*
// Read data, arbitrarily from memory. (half-wise)

. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LHU(a3, a1, 0);	//lhu a3, 0(a1)       // Read from RAM
	XW_C_SH(a3, a4, 0);		//sh a3, 0(a4)       // Store into scratchpad
	c.addi a1, 2        // Advance pointers
	c.addi a4, 2
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0,0
*/

/*
// Read data, arbitrarily from memory. (word-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	lw a3, 0(a1);		//lw a3, 0(a1)       // Read from RAM
	sw a3, 0(a4);		//sw a3, 0(a4)       // Store into scratchpad
	c.addi a1, 4        // Advance pointers
	c.addi a4, 4
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0,0
*/
/*
// Write data, arbitrarily to memory. (word-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	lw a3, 0(a4);		//lw a3, 0(a1)       // Read from RAM
	sw a3, 0(a1);		//sw a3, 0(a4)       // Store into scratchpad
	lw a3, 0(a1);       // Read-back
	sw a3, 0(a4);
	c.addi a1, 4        // Advance pointers
	c.addi a4, 4
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0
*/

/*
// Write data, arbitrarily to memory. (word-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LHU(a3, a4, 0);	//lbu a3, 0(a4)       // Read from scratchpad
	XW_C_SH(a3, a1, 0);		//sb a3, 0(a1)       // Store into RAM
	XW_C_LHU(a3, a1, 0);	//lbu a3, 0(a4)       //  Read back
	XW_C_SH(a3, a4, 0);		//sb a3, 0(a1) 
	c.addi a1, 2        // Advance pointers
	c.addi a4, 2
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0
*/

/*
// Write data, arbitrarily to memory. (byte-wise)
. =  0x66
	sw x0, 0(a1);       // Stop Countdown
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // Get starting address to read
	c.lw a2, 4(a4);     // Get length to read.
	c.add a2, a1        // a2 is now ending address.
	c.addi a4, 8		// start writing back at byte 60.
1:
	XW_C_LBU(a3, a4, 0);	//lbu a3, 0(a4)       // Read from scratchpad
	XW_C_SB(a3, a1, 0);		//sb a3, 0(a1)       // Store into RAM
	XW_C_LBU(a3, a1, 0);	//Read back
	XW_C_SB(a3, a4, 0);
	c.addi a1, 1        // Advance pointers
	c.addi a4, 1
	blt a1, a2, 1b      // Loop til all read.
	addi a3, x0, -1
	sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
	.long 0,0,0,0,0,0
*/


/* Run app blob (old)
				FLASH->BOOT_MODEKEYR = FLASH_KEY1;
				FLASH->BOOT_MODEKEYR = FLASH_KEY2;
				FLASH->STATR = 0; // 1<<14 is zero, so, boot user code.
				FLASH->CTLR = CR_LOCK_Set;
				PFIC->SCTLR = 1<<31;
*/

/* Run app blob (new)
	Explaining the changes:
	One issue I had is that when not using DPU pin, but constantly pulling D- with a resistor, v003 doesn't reenumerate after minichlink -b.
	That's when I thought I could add pulling D- low for a few ms before booting user code after minichlink -b.
	Then I could call that function via blob, instead of sending it whole.
	Offset to the function address, that could be in different places if we ever update bootloader's code, is stored now at the last 4 bytes of the bootloader region, at 0x77C offset.
	Also along the offset of the boot_usercode function, at higher part of 0x77C word stored XOR of the offset and 0x77C.
	This is done so we can have backward compatibility in minichlink after updating to new blob.
*/


/* Write flash block 64.

. =  0x66
	addi a4, a0, 52;    // Start reading properties, starting from scratchpad + 52.
	c.lw a1, 0(a4);     // a1 = Address to write to.
	addi a2, a1, 64     // a2 = end of section to write to
	c.lw a5, 4(a4);     // a5 = Get flash address (0x40022010)

	// Must be done outside.
//	li a3, 0x00080000 | 0x00010000;
	//c.sw a3, 0(a5);  //FLASH->CTLR = CR_BUF_RST | CR_PAGE_PG
	c.sw a1, 8(a5);     //FLASH->ADDR = writing location.

	1:
		c.lw a3, 8(a4);		//lw a3, 0(a1)       // Read from RAM (Starting @60)
		c.sw a3, 0(a1);		//sw a3, 0(a4)       // Store into flash

		li a3, 0x00010000 | 0x00040000;	// CR_PAGE_PG | FLASH_CTLR_BUF_LOAD
		c.sw a3, 4(a5);     // Load into flash write buffer.

		c.lw a3, 0(a1);		//Tricky: By reading from flash here, we force it to wait for completion.
		c.addi a1, 4        // Advance pointers
		c.addi a4, 4

	//	// Wait for write to complete.
	//	2:	c.lw a3, 0(a5)   // read FLASH->STATR 
	//		c.andi a3, 1     // Mask off BUSY bit.
	//		c.bnez a3, 2b


		blt a1, a2, 1b      // Loop til all read.

	li a3, 0x00010000 | 0x00000040 //CR_PAGE_PG|CR_STRT_Set
	c.sw a3, 4(a5);     //FLASH->CTRL = CR_PAGE_PG|CR_STRT_Set
	li a3, -1
	c.sw a3, 0(a0)		// Write -1 into 0x00 indicating all done.
	ret
*/
